org/jmn.org
# Created 2015-04-17 fre 22:10
#+OPTIONS: toc:4 h:4
#+TITLE: jmn's Emacs configuration
#+AUTHOR: Jussi Norlund
#+STARTUP: align indent fold nodlcheck hidestars oddeven lognotestate overview
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.jmnorlund.net/css/base.css" />
#+HTML_HEAD_EXTRA: <script src="https://carnivalapp.io/sites/20/init.js"></script>
#+HTML_HEAD_EXTRA: <script>document.addEventListener("DOMContentLoaded", function() { Carnival.init({enabled: true, article_author: "jmn", article_selector: "div#content", block_selector: ":scope p, :scope pre",});});</script>
* Configuration
** About this file
This is my configuration file for GNU Emacs. 

Inspired by Sacha Chua's configuration. Parts of this file are directly copied from their configuration.
See [[http://sach.ac/dotemacs]]

This configuration file uses org-babel to load. Load this file using
=(org-babel-load-file "/path/to/file")=,
changing the path appropriately, but you'll probably want to tweak it
extensively first. 

Tips:
- To edit source code blocks in org-mode, hit =C-c '=
- To show syntax highligting in code blocks use =M-x org-src-fontify-buffer=

*** Configure ~/.emacs.d/init.el
To load this file when Emacs starts I put the following code into =~/.emacs.d/init.el=:

#+BEGIN_SRC emacs-lisp :tangle no
        ;; This sets up the load path so that we can override it
        (package-initialize nil)
        ;; Override the packages with the git version of Org and other packages
        (add-to-list 'load-path "~/git/org-mode/lisp")
        (add-to-list 'load-path "~/git/org-mode/contrib/lisp")
        ;; Load the rest of the packages
        (package-initialize t)
        (setq package-enable-at-startup nil)
        (require 'org)
        (require 'ob-tangle)
        (org-babel-load-file (expand-file-name "~/git/notes/jmn.org"))
#+END_SRC

** Personal information
#+BEGIN_SRC emacs-lisp
      (setq user-full-name "jmn"
            user-mail-address "norlund@gmail.com")
#+END_SRC

** Emacs initialization
*** Add my elisp directory and other files
#+BEGIN_SRC emacs-lisp
        (add-to-list 'load-path "~/.emacs.d/elisp")
        (add-to-list 'load-path "~/elisp")
        ; (load-file "~/.emacs.secrets")        ; Contains private information
        (add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
        (add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/") t)
        (unless (package-installed-p 'use-package)
          (package-install 'use-package))
        (require 'use-package)
#+END_SRC
*** Paths
#+BEGIN_SRC emacs-lisp
        (setq exec-path (append exec-path '("/usr/local/bin")))
#+END_SRC

*** Inhibit startup message
#+BEGIN_SRC emacs-lisp
        (setq inhibit-startup-buffer-menu t)
         (setq inhibit-startup-echo-area-message nil)
         (setq inhibit-startup-screen t)
         (setq initial-scratch-message ";; Scratch buffer 
        ")
#+END_SRC

*** Start the edit server
For use with "emacsclient".

#+BEGIN_SRC emacs-lisp
        (server-start)
#+END_SRC
** General configuration
*** Appearance
**** Theme
Good themes (dark): tango-dark, monokai, solarized-dark, heroku,
minimal (no colors), monochrome (same, misterioso), cyberpunk.
brighter themes: solarized-light, anti-zenburn

#+BEGIN_SRC emacs-lisp
        (setq monokai-use-variable-pitch nil)
        (setq visible-bell 1)                   ; Disables the audible bell.
#+END_SRC

**** Line numbers
#+BEGIN_SRC emacs-lisp
        (setq linum-format " %4d   ")
#+END_SRC

**** Fonts and faces
The default font is used for most faces. Sometimes I want to use a serif font non-monospace font such as Times New roman or Gotham HTF and other times I prefer a monospace font such as Consolas (Windows), Monaco (Mac) or Dejavu Sans (GNU/Linux).
