jmn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>jmn's Emacs configuration</title>
<!-- 2015-04-18 lör 03:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="jmn" />
<link rel="stylesheet" type="text/css" href="http://www.jmnorlund.net/public/css/base.css" />
</head>
<body>
<div id="content">
<h1 class="title">jmn's Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Configuration</a>
<ul>
<li><a href="#sec-1-1">1.1. About this file</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Configure ~/.emacs.d/init.el</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Personal information</a></li>
<li><a href="#sec-1-3">1.3. Emacs initialization</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Add my elisp directory and other files</a></li>
<li><a href="#sec-1-3-2">1.3.2. Paths</a></li>
<li><a href="#sec-1-3-3">1.3.3. Inhibit startup message</a></li>
<li><a href="#sec-1-3-4">1.3.4. Start the edit server</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. General configuration</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Appearance</a>
<ul>
<li><a href="#sec-1-4-1-1">1.4.1.1. Theme</a></li>
<li><a href="#sec-1-4-1-2">1.4.1.2. Line numbers</a></li>
<li><a href="#sec-1-4-1-3">1.4.1.3. Fonts and faces</a></li>
</ul>
</li>
<li><a href="#sec-1-4-2">1.4.2. Backups</a></li>
<li><a href="#sec-1-4-3">1.4.3. Window configuration</a>
<ul>
<li><a href="#sec-1-4-3-1">1.4.3.1. Toolbars, menus et c</a></li>
<li><a href="#sec-1-4-3-2">1.4.3.2. Window Transparency</a></li>
<li><a href="#sec-1-4-3-3">1.4.3.3. Fullscreen</a></li>
</ul>
</li>
<li><a href="#sec-1-4-4">1.4.4. Modes</a>
<ul>
<li><a href="#sec-1-4-4-1">1.4.4.1. Mode hooks</a></li>
<li><a href="#sec-1-4-4-2">1.4.4.2. Version Control</a></li>
<li><a href="#sec-1-4-4-3">1.4.4.3. Twittering-mode</a></li>
</ul>
</li>
<li><a href="#sec-1-4-5">1.4.5. Useful extra functions</a>
<ul>
<li><a href="#sec-1-4-5-1">1.4.5.1. Sudoedit, edit file as root</a></li>
</ul>
</li>
<li><a href="#sec-1-4-6">1.4.6. Encoding</a></li>
<li><a href="#sec-1-4-7">1.4.7. Minibuffer</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Platform specific configuration</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Windows specific settings</a></li>
<li><a href="#sec-1-5-2">1.5.2. MacOS specific settings</a>
<ul>
<li><a href="#sec-1-5-2-1">1.5.2.1. Notes</a></li>
<li><a href="#sec-1-5-2-2">1.5.2.2. Configuration</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Keybindings</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-6-0-1">1.6.0.1. Fonts, themes et c</a></li>
<li><a href="#sec-1-6-0-2">1.6.0.2. Global org-mode bindings</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-1-7">1.7. Activity specific configuration ('cuz polycephaly)</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. Writing</a>
<ul>
<li><a href="#sec-1-7-1-1">1.7.1.1. ASCIIDoc mode (adoc-mode)</a></li>
<li><a href="#sec-1-7-1-2">1.7.1.2. Visual line mode in text (and org) files</a></li>
<li><a href="#sec-1-7-1-3">1.7.1.3. Writeroom-mode</a></li>
</ul>
</li>
<li><a href="#sec-1-7-2">1.7.2. org-mode: note-taking, activity management et c.</a>
<ul>
<li><a href="#sec-1-7-2-1">1.7.2.1. General org-mode buffer settings</a></li>
<li><a href="#sec-1-7-2-2">1.7.2.2. Inline code (org-babel)</a></li>
<li><a href="#sec-1-7-2-3">1.7.2.3. org-capture templates</a></li>
<li><a href="#sec-1-7-2-4">1.7.2.4. Notes</a></li>
<li><a href="#sec-1-7-2-5">1.7.2.5. Faces</a></li>
<li><a href="#sec-1-7-2-6">1.7.2.6. Monospace fonts for tables, quotes et c</a></li>
<li><a href="#sec-1-7-2-7">1.7.2.7. Publishing from org-mode</a></li>
</ul>
</li>
<li><a href="#sec-1-7-3">1.7.3. Programming</a>
<ul>
<li><a href="#sec-1-7-3-1">1.7.3.1. Highlight keywords</a></li>
<li><a href="#sec-1-7-3-2">1.7.3.2. Go autocomplete</a></li>
<li><a href="#sec-1-7-3-3">1.7.3.3. Clojure</a></li>
<li><a href="#sec-1-7-3-4">1.7.3.4. Magit - nice git interface</a></li>
</ul>
</li>
<li><a href="#sec-1-7-4">1.7.4. Editing</a>
<ul>
<li><a href="#sec-1-7-4-1">1.7.4.1. Digits increment/decrement</a></li>
</ul>
</li>
<li><a href="#sec-1-7-5">1.7.5. Diffing (ediff)</a>
<ul>
<li><a href="#sec-1-7-5-1">1.7.5.1. Ediff for org-files</a></li>
</ul>
</li>
<li><a href="#sec-1-7-6">1.7.6. IRC</a></li>
<li><a href="#sec-1-7-7">1.7.7. Jabber (XMPP)</a></li>
<li><a href="#sec-1-7-8">1.7.8. Mail (gnus and Gmail)</a>
<ul>
<li><a href="#sec-1-7-8-1">1.7.8.1. .authinfo</a></li>
<li><a href="#sec-1-7-8-2">1.7.8.2. .gnus</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> About this file</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This is my configuration file for GNU Emacs. 
</p>

<p>
Inspired by Sacha Chua's configuration. Parts of this file are directly copied from their configuration.
See <a href="http://sach.ac/dotemacs">http://sach.ac/dotemacs</a>
</p>

<p>
This configuration file uses org-babel to load. Load this file using
<code>(org-babel-load-file "/path/to/file")</code>,
changing the path appropriately, but you'll probably want to tweak it
extensively first. 
</p>

<p>
Tips:
</p>
<ul class="org-ul">
<li>To edit source code blocks in org-mode, hit =C-c '=
</li>
<li>To show syntax highligting in code blocks use <code>M-x org-src-fontify-buffer</code>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Configure ~/.emacs.d/init.el</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
To load this file when Emacs starts I put the following code into <code>~/.emacs.d/init.el</code>:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">This sets up the load path so that we can override it</span>
(package-initialize nil)
<span style="color: #73d216;">;; </span><span style="color: #73d216;">Override the packages with the git version of Org and other packages</span>
(add-to-list 'load-path <span style="color: #e9b96e;">"~/git/org-mode/lisp"</span>)
(add-to-list 'load-path <span style="color: #e9b96e;">"~/git/org-mode/contrib/lisp"</span>)
<span style="color: #73d216;">;; </span><span style="color: #73d216;">Load the rest of the packages</span>
(package-initialize t)
(setq package-enable-at-startup nil)
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">org</span>)
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">ob-tangle</span>)
(org-babel-load-file (expand-file-name <span style="color: #e9b96e;">"~/git/notes/jmn.org"</span>))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Personal information</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name <span style="color: #e9b96e;">"jmn"</span>
      user-mail-address <span style="color: #e9b96e;">"norlund@gmail.com"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Emacs initialization</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Add my elisp directory and other files</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path <span style="color: #e9b96e;">"~/.emacs.d/elisp"</span>)
(add-to-list 'load-path <span style="color: #e9b96e;">"~/elisp"</span>)
<span style="color: #73d216;">; </span><span style="color: #73d216;">(load-file "~/.emacs.secrets")        ; Contains private information</span>
(add-to-list 'package-archives '(<span style="color: #e9b96e;">"org"</span> . <span style="color: #e9b96e;">"http://orgmode.org/elpa/"</span>) t)
(add-to-list 'package-archives '(<span style="color: #e9b96e;">"melpa"</span> . <span style="color: #e9b96e;">"http://melpa.milkbox.net/packages/"</span>) t)
(<span style="color: #b4fa70;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">use-package</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Paths</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq exec-path (append exec-path '(<span style="color: #e9b96e;">"/usr/local/bin"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Inhibit startup message</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq inhibit-startup-buffer-menu t)
 (setq inhibit-startup-echo-area-message nil)
 (setq inhibit-startup-screen t)
 (setq initial-scratch-message <span style="color: #e9b96e;">";; Scratch buffer </span>
<span style="color: #e9b96e;">"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Start the edit server</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
For use with "emacsclient".
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(server-start)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> General configuration</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Appearance</h4>
<div class="outline-text-4" id="text-1-4-1">
</div><div id="outline-container-sec-1-4-1-1" class="outline-5">
<h5 id="sec-1-4-1-1"><span class="section-number-5">1.4.1.1</span> Theme</h5>
<div class="outline-text-5" id="text-1-4-1-1">
<p>
Good themes (dark): tango-dark, monokai, solarized-dark, heroku,
minimal (no colors), monochrome (same, misterioso), cyberpunk.
brighter themes: solarized-light, anti-zenburn
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq monokai-use-variable-pitch nil)
(setq visible-bell 1)                   <span style="color: #73d216;">; </span><span style="color: #73d216;">Disables the audible bell.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-1-2" class="outline-5">
<h5 id="sec-1-4-1-2"><span class="section-number-5">1.4.1.2</span> Line numbers</h5>
<div class="outline-text-5" id="text-1-4-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq linum-format <span style="color: #e9b96e;">" %4d   "</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-1-3" class="outline-5">
<h5 id="sec-1-4-1-3"><span class="section-number-5">1.4.1.3</span> Fonts and faces</h5>
<div class="outline-text-5" id="text-1-4-1-3">
<p>
The default font is used for most faces. Sometimes I want to use a serif font non-monospace font such as Times New roman or Gotham HTF and other times I prefer a monospace font such as Consolas (Windows), Monaco (Mac) or Dejavu Sans (GNU/Linux).
</p>
</div>
