org/jmn.org
***** Font helper function
Reminder (to self): To experiment with font selection, use the menu then the =C-u C-x == command to find the name of the font used.

Other faces, besides "default"  which you might want to set fonts for are: "fixed-pitch" and "linum".

#+BEGIN_SRC emacs-lisp
    (require 'cl)
      (defun font-candidate (&rest fonts)
         "Return existing font which first match."
         (find-if (lambda (f) (find-font (font-spec :name f))) fonts))
#+END_SRC

***** Default font
Choose which block to tangle depending on font preference. See also
the variable-pitch-mode for when you want to default to monospace but
sometimes toggle to use "variable pitch".

Alternative serif fonts on Windows: Cambria, Times New Roman, Gotham HTF Light (?)
#+BEGIN_SRC emacs-lisp :tangle no
        ;; Serif font as default font
        (when window-system
        (set-face-attribute 'default nil :font (font-candidate '"Times New Roman-14:weight=normal:height:120" "Liberation Serif-12" "FreeSerif-14" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))
        )
#+END_SRC

#+BEGIN_SRC emacs-lisp
        ;; Monospace as default font
        (when window-system
        (set-face-attribute 'default nil :font (font-candidate '"Consolas-14:weight=normal:height=160" "DejaVu Sans Mono-11:weight=normal"))
        )
#+END_SRC

***** Variable Font setting on Microsoft Windows
- Monospace as variable pitch font
#+BEGIN_SRC emacs-lisp :tangle no
        (when window-system 
          (set-face-attribute 'variable-pitch nil :font (font-candidate '"Consolas-14:weight=normal:height=160" "DejaVu Sans Mono-10:weight=normal"))
          )
#+END_SRC

- Serif font as variable pitch font
#+BEGIN_SRC emacs-lisp
        (when window-system
          (set-face-attribute 'variable-pitch nil :font (font-candidate '"Times New Roman-14:weight=normal:height:120" "Liberation Serif-12" "FreeSerif-14" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))
          )
#+END_SRC

***** Text mode font
#+BEGIN_SRC emacs-lisp
        (add-hook 'text-mode-hook 'variable-pitch-mode)
#+END_SRC

***** Font for org-mode tables and code blocks
([[https://yoo2080.wordpress.com/2013/05/30/monospace-font-in-tables-and-source-code-blocks-in-org-mode-proportional-font-in-other-parts/][source]])
#+BEGIN_SRC emacs-lisp
        (defun my-adjoin-to-list-or-symbol (element list-or-symbol)
          (let ((list (if (not (listp list-or-symbol))
                          (list list-or-symbol)
                        list-or-symbol)))
            (require 'cl-lib)
            (cl-adjoin element list)))

        (eval-after-load "org"
          '(mapc
            (lambda (face)
              (set-face-attribute
               face nil
               :inherit
               (my-adjoin-to-list-or-symbol
                'fixed-pitch
                (face-attribute face :inherit))))
            (list 'org-code 'org-block 'org-table)))
#+END_SRC
***** Linum font
#+BEGIN_SRC emacs-lisp
        ;; (set-face-attribute 'linum nil :font (font-candidate '"Cambria-14" "Times New Roman-14:weight=normal:height:120" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))
        ;; (set-face-attribute 'linum nil :font (font-candidate ' "Times New Roman-14:weight=normal:height:120" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))
#+END_SRC
***** Pretty lambda
Display the greek character lambda instead of the word.
#+BEGIN_SRC emacs-lisp
        (use-package pretty-lambdada
          :ensure pretty-lambdada)
#+END_SRC

*** Backups
By default, Emacs saves backup files in the current directory. These are the files ending in =~= that are cluttering up your directory lists. The following code stashes them all in =~/.emacs.d/backups=, where I can find them with =C-x C-f= (=find-file=) if I really need to.

#+BEGIN_SRC emacs-lisp
        (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
#+END_SRC

Disk space is cheap. Save lots.

#+BEGIN_SRC emacs-lisp
        (setq delete-old-versions -1)
        (setq version-control t)
        (setq vc-make-backup-files t)
        (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC

*** Window configuration
**** Toolbars, menus et c
#+BEGIN_SRC emacs-lisp
        (when window-system
          (tooltip-mode -1)
          (tool-bar-mode -1)
          (set-fringe-mode 0)
        )
        (menu-bar-mode -1)
#+END_SRC
**** Window Transparency
#+BEGIN_SRC emacs-lisp
        ;; Emacs Transparency
        ;;(set-frame-parameter (selected-frame) 'alpha '(<active> [<inactive>]))
        (set-frame-parameter (selected-frame)  'alpha '(100 100))
        ;; (set-frame-parameter (selected-frame) 'alpha '(85 50))
        (add-to-list 'default-frame-alist '(alpha 100 100))

         (eval-when-compile (require 'cl))
         (defun toggle-transparency ()
           (interactive)
           (if (/=
                (cadr (frame-parameter nil 'alpha))
                100)
               (set-frame-parameter nil 'alpha '(100 100))
             (set-frame-parameter nil 'alpha '(85 50))))
        (global-set-key (kbd "C-c t") 'toggle-transparency)
#+END_SRC

**** Fullscreen
#+BEGIN_SRC emacs-lisp
        (if (eq system-type 'gnu/linux)  ; GNU/Linux uses the fullscreen-mode package
         (progn 
         (use-package fullscreen-mode
         :ensure fullscreen-mode
         :bind 
         (("<f4>" . fullscreen-mode-fullscreen-toggle))
         )))
#+END_SRC
*** Modes
