jmn.html
<ol class="org-ol"><li><a id="sec-1-4-1-3-1"></a>Font helper function<br  /><div class="outline-text-6" id="text-1-4-1-3-1">
<p>
Reminder (to self): To experiment with font selection, use the menu then the <code>C-u C-x =</code> command to find the name of the font used.
</p>

<p>
Other faces, besides "default"  which you might want to set fonts for are: "fixed-pitch" and "linum".
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">cl</span>)
  (<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">font-candidate</span> (<span style="color: #8cc4ff;">&amp;rest</span> fonts)
     <span style="color: #e9b96e;">"Return existing font which first match."</span>
     (find-if (<span style="color: #b4fa70;">lambda</span> (f) (find-font (font-spec <span style="color: #e090d7;">:name</span> f))) fonts))
</pre>
</div>
</div>
</li>

<li><a id="sec-1-4-1-3-2"></a>Default font<br  /><div class="outline-text-6" id="text-1-4-1-3-2">
<p>
Choose which block to tangle depending on font preference. See also
the variable-pitch-mode for when you want to default to monospace but
sometimes toggle to use "variable pitch".
</p>

<p>
Alternative serif fonts on Windows: Cambria, Times New Roman, Gotham HTF Light (?)
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">Serif font as default font</span>
(<span style="color: #b4fa70;">when</span> window-system
(set-face-attribute 'default nil <span style="color: #e090d7;">:font</span> (font-candidate '<span style="color: #e9b96e;">"Times New Roman-14:weight=normal:height:120"</span> <span style="color: #e9b96e;">"Liberation Serif-12"</span> <span style="color: #e9b96e;">"FreeSerif-14"</span> <span style="color: #e9b96e;">"DejaVu Sans Mono-10:weight=normal"</span> <span style="color: #e9b96e;">"Gill Sans-14"</span>))
)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">Monospace as default font</span>
(<span style="color: #b4fa70;">when</span> window-system
(set-face-attribute 'default nil <span style="color: #e090d7;">:font</span> (font-candidate '<span style="color: #e9b96e;">"Consolas-14:weight=normal:height=160"</span> <span style="color: #e9b96e;">"DejaVu Sans Mono-11:weight=normal"</span>))
)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-4-1-3-3"></a>Variable Font setting on Microsoft Windows<br  /><div class="outline-text-6" id="text-1-4-1-3-3">
<ul class="org-ul">
<li>Monospace as variable pitch font
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">when</span> window-system 
  (set-face-attribute 'variable-pitch nil <span style="color: #e090d7;">:font</span> (font-candidate '<span style="color: #e9b96e;">"Consolas-14:weight=normal:height=160"</span> <span style="color: #e9b96e;">"DejaVu Sans Mono-10:weight=normal"</span>))
  )
</pre>
</div>

<ul class="org-ul">
<li>Serif font as variable pitch font
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">when</span> window-system
  (set-face-attribute 'variable-pitch nil <span style="color: #e090d7;">:font</span> (font-candidate '<span style="color: #e9b96e;">"Times New Roman-14:weight=normal:height:120"</span> <span style="color: #e9b96e;">"Liberation Serif-12"</span> <span style="color: #e9b96e;">"FreeSerif-14"</span> <span style="color: #e9b96e;">"DejaVu Sans Mono-10:weight=normal"</span> <span style="color: #e9b96e;">"Gill Sans-14"</span>))
  )
</pre>
</div>
</div>
</li>

<li><a id="sec-1-4-1-3-4"></a>Text mode font<br  /><div class="outline-text-6" id="text-1-4-1-3-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'variable-pitch-mode)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-4-1-3-5"></a>Font for org-mode tables and code blocks<br  /><div class="outline-text-6" id="text-1-4-1-3-5">
<p>
(<a href="https://yoo2080.wordpress.com/2013/05/30/monospace-font-in-tables-and-source-code-blocks-in-org-mode-proportional-font-in-other-parts/">source</a>)
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-adjoin-to-list-or-symbol</span> (element list-or-symbol)
  (<span style="color: #b4fa70;">let</span> ((list (<span style="color: #b4fa70;">if</span> (not (listp list-or-symbol))
                  (list list-or-symbol)
                list-or-symbol)))
    (<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">cl-lib</span>)
    (cl-adjoin element list)))

(eval-after-load <span style="color: #e9b96e;">"org"</span>
  '(mapc
    (<span style="color: #b4fa70;">lambda</span> (face)
      (set-face-attribute
       face nil
       <span style="color: #e090d7;">:inherit</span>
       (my-adjoin-to-list-or-symbol
        'fixed-pitch
        (face-attribute face <span style="color: #e090d7;">:inherit</span>))))
    (list 'org-code 'org-block 'org-table)))
</pre>
</div>
</div>
</li>
<li><a id="sec-1-4-1-3-6"></a>Linum font<br  /><div class="outline-text-6" id="text-1-4-1-3-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">(set-face-attribute 'linum nil :font (font-candidate '"Cambria-14" "Times New Roman-14:weight=normal:height:120" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))</span>
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(set-face-attribute 'linum nil :font (font-candidate ' "Times New Roman-14:weight=normal:height:120" "DejaVu Sans Mono-10:weight=normal" "Gill Sans-14"))</span>
</pre>
</div>
</div>
</li>
<li><a id="sec-1-4-1-3-7"></a>Pretty lambda<br  /><div class="outline-text-6" id="text-1-4-1-3-7">
<p>
Display the greek character lambda instead of the word.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">pretty-lambdada</span>
  <span style="color: #e090d7;">:ensure</span> pretty-lambdada)
</pre>
</div>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Backups</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
By default, Emacs saves backup files in the current directory. These are the files ending in <code>~</code> that are cluttering up your directory lists. The following code stashes them all in <code>~/.emacs.d/backups</code>, where I can find them with <code>C-x C-f</code> (<code>find-file</code>) if I really need to.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq backup-directory-alist '((<span style="color: #e9b96e;">"."</span> . <span style="color: #e9b96e;">"~/.emacs.d/backups"</span>)))
</pre>
</div>

<p>
Disk space is cheap. Save lots.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq delete-old-versions -1)
(setq version-control t)
(setq vc-make-backup-files t)
(setq auto-save-file-name-transforms '((<span style="color: #e9b96e;">".*"</span> <span style="color: #e9b96e;">"~/.emacs.d/auto-save-list/"</span> t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Window configuration</h4>
<div class="outline-text-4" id="text-1-4-3">
</div><div id="outline-container-sec-1-4-3-1" class="outline-5">
<h5 id="sec-1-4-3-1"><span class="section-number-5">1.4.3.1</span> Toolbars, menus et c</h5>
<div class="outline-text-5" id="text-1-4-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">when</span> window-system
  (tooltip-mode -1)
  (tool-bar-mode -1)
  (set-fringe-mode 0)
)
(menu-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-3-2" class="outline-5">
<h5 id="sec-1-4-3-2"><span class="section-number-5">1.4.3.2</span> Window Transparency</h5>
<div class="outline-text-5" id="text-1-4-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">Emacs Transparency</span>
<span style="color: #73d216;">;;</span><span style="color: #73d216;">(set-frame-parameter (selected-frame) 'alpha '(&lt;active&gt; [&lt;inactive&gt;]))</span>
(set-frame-parameter (selected-frame)  'alpha '(100 100))
<span style="color: #73d216;">;; </span><span style="color: #73d216;">(set-frame-parameter (selected-frame) 'alpha '(85 50))</span>
(add-to-list 'default-frame-alist '(alpha 100 100))

 (<span style="color: #b4fa70;">eval-when-compile</span> (<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">cl</span>))
 (<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">toggle-transparency</span> ()
   (interactive)
   (<span style="color: #b4fa70;">if</span> (/=
        (cadr (frame-parameter nil 'alpha))
        100)
       (set-frame-parameter nil 'alpha '(100 100))
     (set-frame-parameter nil 'alpha '(85 50))))
(global-set-key (kbd <span style="color: #e9b96e;">"C-c t"</span>) 'toggle-transparency)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3-3" class="outline-5">
<h5 id="sec-1-4-3-3"><span class="section-number-5">1.4.3.3</span> Fullscreen</h5>
<div class="outline-text-5" id="text-1-4-3-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">if</span> (eq system-type 'gnu/linux)  <span style="color: #73d216;">; </span><span style="color: #73d216;">GNU/Linux uses the fullscreen-mode package</span>
 (<span style="color: #b4fa70;">progn</span> 
 (<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">fullscreen-mode</span>
 <span style="color: #e090d7;">:ensure</span> fullscreen-mode
 <span style="color: #e090d7;">:bind</span> 
 ((<span style="color: #e9b96e;">"&lt;f4&gt;"</span> . fullscreen-mode-fullscreen-toggle))
 )))
</pre>
</div>
</div>
</div>
</div>
