org/jmn.org
**** Mode hooks
I want linum mode (line numbers) enabled in these modes:
#+BEGIN_SRC emacs-lisp :tangle no
        (add-hook 'text-mode-hook 'linum-mode)
#+END_SRC

Trying auto-complete-mode in these modes:
#+BEGIN_SRC emacs-lisp :tangle no
        (add-hook 'text-mode-hook 'auto-complete-mode)
#+END_SRC
**** Version Control
***** Magit
#+BEGIN_SRC emacs-lisp
        (use-package magit
        :ensure magit
        :bind ("C-c m" . magit-status)) 
#+END_SRC
***** vc-check-status
vc-check-status reminds about uncommitted and unpushed changes when exiting Emacs.
#+BEGIN_SRC emacs-lisp
        (use-package vc-check-status
        :ensure vc-check-status
        :init 
        (progn
        (vc-check-status-activate 1))
        )
#+END_SRC
**** Twittering-mode
View Twitter timelines or send tweets using =M-x tweet=.
#+BEGIN_SRC emacs-lisp
        (use-package twittering-mode
          :ensure twittering-mode 
          :config 
          (defalias 'tweet 'twittering-update-status-interactive)
          (setq twittering-use-master-password t)
          ;; Don't show the client type in feed:
          (setq twittering-status-format "%i %s,  %@: 
        %FILL[  ]{%T %L%r%R}
         ")
          (add-hook 'twittering-mode-hook 'variable-pitch-mode)
          (setq twittering-icon-mode t)               ; Show icons
          )
#+END_SRC
*** Useful extra functions
**** Sudoedit, edit file as root
m-x sudoedit reopens the file as root. ([[http://emacsredux.com/blog/2013/04/21/edit-files-as-root/][source: emacsredux.com]])

Tip: It is also possible to do:

#+BEGIN_SRC :tangle no
    alias E="SUDO_EDITOR=\"emacsclient -t -a emacs\" sudoedit"
#+END_SRC

in your shell. 

#+BEGIN_SRC emacs-lisp
    (defun sudo-edit (&optional arg)
      "Edit currently visited file as root.

    With a prefix ARG prompt for a file to visit.
    Will also prompt for a file to visit if current
    buffer is not visiting a file."
      (interactive "P")
      (if (or arg (not buffer-file-name))
          (find-file (concat "/sudo:root@localhost:"
                             (ido-read-file-name "Find file(as root): ")))
        (find-alternate-file (concat "/sudo:root@localhost:" buffer-file-name))))
#+END_SRC
*** Encoding
Prefer UTF-8. ([[http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html][source]])
#+BEGIN_SRC emacs-lisp
        (prefer-coding-system 'utf-8)
        (when (display-graphic-p)
          (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
#+END_SRC

*** Minibuffer
#+BEGIN_SRC emacs-lisp
        (require 'uniquify)
        (setq uniquify-buffer-name-style 'post-forward-angle-brackets)
#+END_SRC

** Platform specific configuration
*** Windows specific settings
#+BEGIN_SRC emacs-lisp
      (if (eq system-type 'windows-nt)  ; Windows settings
       (progn 
         (setq home "c:/Users/jmn") 
         (setq default-directory "c:/Users/jmn") 
         ))
#+END_SRC

*** MacOS specific settings
**** Notes
Note: To work effectively with Emacs on Mac you might want to reconfigure a few things in MacOS, namely:
- Rebind Caps lock to function as a control key
- Free C-Space from being bound to spotlight (it's used in Emacs to mark region).
  To do this see: System Preferences > Keyboard > Keyboard Shortcuts > Spotlight. Rebind Spotlight to something else (i.e C-Option-Space).

***** Problematic keybindings / conflicts
With paredit: On Mac, C-<left arrow>/<right arrow> is already bound.

**** Configuration
#+BEGIN_SRC emacs-lisp
      (if (eq system-type 'darwin)
           (setq mac-option-modifier nil
              mac-command-modifier 'meta
              x-select-enable-clipboard t)
    (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize))
    )
#+END_SRC

Launching Emacs from Mac OS Spotlight (launchd) will not provide the same paths as if you would launch it from bash, the exec-path-from-shell package fixes this (useful for tools like leiningen and others)

** Keybindings
**** Fonts, themes et c
#+BEGIN_SRC emacs-lisp
        (global-set-key '[f12] 'variable-pitch-mode)
        (global-set-key '[f8]  '(lambda () (interactive) (auto-complete-mode)))
        (global-set-key '[f9]  '(lambda () (interactive) (load-theme 'anti-zenburn t)))
        (global-set-key '[f10] '(lambda () (interactive) (load-theme 'yellow-postits t)))
#+END_SRC

**** Global org-mode bindings
#+BEGIN_SRC emacs-lisp
    	(global-set-key (kbd "C-c c") 'org-capture)
    	(global-set-key (kbd "C-c o") 'org-capture-goto-last-stored)
    	(global-set-key (kbd "C-c a") 'org-agenda)
#+END_SRC

** Activity specific configuration ('cuz polycephaly)
*** Writing
