jmn.html
<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Modes</h4>
<div class="outline-text-4" id="text-1-4-4">
</div><div id="outline-container-sec-1-4-4-1" class="outline-5">
<h5 id="sec-1-4-4-1"><span class="section-number-5">1.4.4.1</span> Mode hooks</h5>
<div class="outline-text-5" id="text-1-4-4-1">
<p>
I want linum mode (line numbers) enabled in these modes:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'linum-mode)
</pre>
</div>

<p>
Trying auto-complete-mode in these modes:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'auto-complete-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-4-2" class="outline-5">
<h5 id="sec-1-4-4-2"><span class="section-number-5">1.4.4.2</span> Version Control</h5>
<div class="outline-text-5" id="text-1-4-4-2">
</div><ol class="org-ol"><li><a id="sec-1-4-4-2-1"></a>Magit<br  /><div class="outline-text-6" id="text-1-4-4-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">magit</span>
<span style="color: #e090d7;">:ensure</span> magit
<span style="color: #e090d7;">:bind</span> (<span style="color: #e9b96e;">"C-c m"</span> . magit-status))
</pre>
</div>
</div>
</li>
<li><a id="sec-1-4-4-2-2"></a>vc-check-status<br  /><div class="outline-text-6" id="text-1-4-4-2-2">
<p>
vc-check-status reminds about uncommitted and unpushed changes when exiting Emacs.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">vc-check-status</span>
<span style="color: #e090d7;">:ensure</span> vc-check-status
<span style="color: #e090d7;">:init</span> 
(<span style="color: #b4fa70;">progn</span>
(vc-check-status-activate 1))
)
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-4-3" class="outline-5">
<h5 id="sec-1-4-4-3"><span class="section-number-5">1.4.4.3</span> Twittering-mode</h5>
<div class="outline-text-5" id="text-1-4-4-3">
<p>
View Twitter timelines or send tweets using <code>M-x tweet</code>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">twittering-mode</span>
  <span style="color: #e090d7;">:ensure</span> twittering-mode 
  <span style="color: #e090d7;">:config</span> 
  (<span style="color: #b4fa70;">defalias</span> '<span style="color: #fce94f;">tweet</span> 'twittering-update-status-interactive)
  (setq twittering-use-master-password t)
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">Don't show the client type in feed:</span>
  (setq twittering-status-format <span style="color: #e9b96e;">"%i %s,  %@: </span>
<span style="color: #e9b96e;">%FILL[  ]{%T %L%r%R}</span>
<span style="color: #e9b96e;"> "</span>)
  (add-hook 'twittering-mode-hook 'variable-pitch-mode)
  (setq twittering-icon-mode t)               <span style="color: #73d216;">; </span><span style="color: #73d216;">Show icons</span>
  )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> Useful extra functions</h4>
<div class="outline-text-4" id="text-1-4-5">
</div><div id="outline-container-sec-1-4-5-1" class="outline-5">
<h5 id="sec-1-4-5-1"><span class="section-number-5">1.4.5.1</span> Sudoedit, edit file as root</h5>
<div class="outline-text-5" id="text-1-4-5-1">
<p>
m-x sudoedit reopens the file as root. (<a href="http://emacsredux.com/blog/2013/04/21/edit-files-as-root/">source: emacsredux.com</a>)
</p>

<p>
Tip: It is also possible to do:
</p>

<div class="org-src-container">

<pre class="src src-:tangle">alias E="SUDO_EDITOR=\"emacsclient -t -a emacs\" sudoedit"
</pre>
</div>

<p>
in your shell. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">sudo-edit</span> (<span style="color: #8cc4ff;">&amp;optional</span> arg)
  <span style="color: #e9b96e;">"Edit currently visited file as root.</span>

<span style="color: #e9b96e;">With a prefix ARG prompt for a file to visit.</span>
<span style="color: #e9b96e;">Will also prompt for a file to visit if current</span>
<span style="color: #e9b96e;">buffer is not visiting a file."</span>
  (interactive <span style="color: #e9b96e;">"P"</span>)
  (<span style="color: #b4fa70;">if</span> (or arg (not buffer-file-name))
      (find-file (concat <span style="color: #e9b96e;">"/sudo:root@localhost:"</span>
                         (ido-read-file-name <span style="color: #e9b96e;">"Find file(as root): "</span>)))
    (find-alternate-file (concat <span style="color: #e9b96e;">"/sudo:root@localhost:"</span> buffer-file-name))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> Encoding</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
Prefer UTF-8. (<a href="http://www.wisdomandwonder.com/wordpress/wp-content/uploads/2014/03/C3F.html">source</a>)
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(prefer-coding-system 'utf-8)
(<span style="color: #b4fa70;">when</span> (display-graphic-p)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> Minibuffer</h4>
<div class="outline-text-4" id="text-1-4-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">uniquify</span>)
(setq uniquify-buffer-name-style 'post-forward-angle-brackets)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Platform specific configuration</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Windows specific settings</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">if</span> (eq system-type 'windows-nt)  <span style="color: #73d216;">; </span><span style="color: #73d216;">Windows settings</span>
 (<span style="color: #b4fa70;">progn</span> 
   (setq home <span style="color: #e9b96e;">"c:/Users/jmn"</span>) 
   (setq default-directory <span style="color: #e9b96e;">"c:/Users/jmn"</span>) 
   ))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> MacOS specific settings</h4>
<div class="outline-text-4" id="text-1-5-2">
</div><div id="outline-container-sec-1-5-2-1" class="outline-5">
<h5 id="sec-1-5-2-1"><span class="section-number-5">1.5.2.1</span> Notes</h5>
<div class="outline-text-5" id="text-1-5-2-1">
<p>
Note: To work effectively with Emacs on Mac you might want to reconfigure a few things in MacOS, namely:
</p>
<ul class="org-ul">
<li>Rebind Caps lock to function as a control key
</li>
<li>Free C-Space from being bound to spotlight (it's used in Emacs to mark region).
To do this see: System Preferences &gt; Keyboard &gt; Keyboard Shortcuts &gt; Spotlight. Rebind Spotlight to something else (i.e C-Option-Space).
</li>
</ul>
</div>

<ol class="org-ol"><li><a id="sec-1-5-2-1-1"></a>Problematic keybindings / conflicts<br  /><div class="outline-text-6" id="text-1-5-2-1-1">
<p>
With paredit: On Mac, C-&lt;left arrow&gt;/&lt;right arrow&gt; is already bound.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-5-2-2" class="outline-5">
<h5 id="sec-1-5-2-2"><span class="section-number-5">1.5.2.2</span> Configuration</h5>
<div class="outline-text-5" id="text-1-5-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">  (<span style="color: #b4fa70;">if</span> (eq system-type 'darwin)
       (setq mac-option-modifier nil
          mac-command-modifier 'meta
          x-select-enable-clipboard t)
(<span style="color: #b4fa70;">when</span> (memq window-system '(mac ns))
(exec-path-from-shell-initialize))
)
</pre>
</div>

<p>
Launching Emacs from Mac OS Spotlight (launchd) will not provide the same paths as if you would launch it from bash, the exec-path-from-shell package fixes this (useful for tools like leiningen and others)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Keybindings</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-0-1" class="outline-5">
<h5 id="sec-1-6-0-1"><span class="section-number-5">1.6.0.1</span> Fonts, themes et c</h5>
<div class="outline-text-5" id="text-1-6-0-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key '[f12] 'variable-pitch-mode)
(global-set-key '[f8]  '(<span style="color: #b4fa70;">lambda</span> () (interactive) (auto-complete-mode)))
(global-set-key '[f9]  '(<span style="color: #b4fa70;">lambda</span> () (interactive) (load-theme 'anti-zenburn t)))
(global-set-key '[f10] '(<span style="color: #b4fa70;">lambda</span> () (interactive) (load-theme 'yellow-postits t)))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-0-2" class="outline-5">
<h5 id="sec-1-6-0-2"><span class="section-number-5">1.6.0.2</span> Global org-mode bindings</h5>
<div class="outline-text-5" id="text-1-6-0-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #e9b96e;">"C-c c"</span>) 'org-capture)
(global-set-key (kbd <span style="color: #e9b96e;">"C-c o"</span>) 'org-capture-goto-last-stored)
(global-set-key (kbd <span style="color: #e9b96e;">"C-c a"</span>) 'org-agenda)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Activity specific configuration ('cuz polycephaly)</h3>
