org/jmn.org
**** ASCIIDoc mode (adoc-mode)
#+BEGIN_SRC emacs-lisp
        (use-package adoc-mode
        :ensure adoc-mode
        :mode "\\.asciidoc\\'"
        :config
        (add-hook 'adoc-mode-hook (lambda() (buffer-face-mode t))))
#+END_SRC

**** Visual line mode in text (and org) files
=visual-line-mode= is so much better than =auto-fill-mode=. It doesn't actually break the text into multiple lines - it only looks that way.

#+BEGIN_SRC emacs-lisp
        (remove-hook 'text-mode-hook #'turn-on-auto-fill)
        (add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+END_SRC

**** Writeroom-mode
Writeroom-mode hides most UI elements.
#+BEGIN_SRC emacs-lisp
        (use-package writeroom-mode
          :ensure writeroom-mode
          )
#+END_SRC
*** org-mode: note-taking, activity management et c.
**** General org-mode buffer settings
Change the font-face so that only the last star indicating an org-mode headline is displayed. This is less resource intensive - and slightly different from -  org-indent-mode).
#+BEGIN_SRC emacs-lisp
        (setq org-hide-leading-stars 't)       
#+END_SRC
**** Inline code (org-babel)
***** Load languages
#+BEGIN_SRC emacs-lisp
        ;; Load relevant languages
        (org-babel-do-load-languages
         'org-babel-load-languages
         '((emacs-lisp . t)
           (clojure . t)
           (go . t)))
#+END_SRC
***** Language mode specific settings
****** Clojure
Use cider as the clojure execution backend.
#+BEGIN_SRC emacs-lisp
        (setq org-babel-clojure-backend 'cider)
#+END_SRC
***** Indention and tabs, Tabs and indentation, in code blocks
#+BEGIN_SRC emacs-lisp
        ;; Let's have pretty source code blocks
        ;; FIXME:  org-src-fontify-natively t -- Problem with variable pitch fonts.
        (setq org-src-fontify-natively nil)
        (setq org-edit-src-content-indentation 4
              org-src-tab-acts-natively t
              org-confirm-babel-evaluate nil)
#+END_SRC
***** Code block expansion templates
Type <s [TAB] , <el [TAB et c to create code blocks. ([[http://kitchingroup.cheme.cmu.edu/blog/2014/01/26/Language-specific-default-headers-for-code-blocks-in-org-mode/][source]])

#+BEGIN_SRC emacs-lisp
        ;; add <p for python expansion
        (add-to-list 'org-structure-template-alist
                     '("p" "#+BEGIN_SRC python\n?\n#+END_SRC" "<src lang=\"python\">\n?\n</src>"))

        ;; add <el for emacs-lisp expansion
        (add-to-list 'org-structure-template-alist
                     '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC" "<src lang=\"emacs-lisp\">\n?\n</src>"))
#+END_SRC

***** Evaluation
To make code blocks evaluate silently by default:

#+BEGIN_SRC emacs-lisp
        (setq org-babel-default-header-args
                  '((:results . "silent")
                        ))
#+END_SRC

**** org-capture templates
#+BEGIN_SRC emacs-lisp
        (setq org-capture-templates
           '(
             ("n" "Short note" entry (file+datetree "~/org/notes.org") 
              "" :empty-lines 1)
             ("b" "Weblog post" entry (file+datetree "~/org/notes.org") 
              "* %^{Title}\n :PROPERTIES:\n:on: %T\n:END:\n  %? %i" :empty-lines 1)
             ("t" "Todo" entry (file+headline "~/org/gtd.org" "Tasks")
                  "* TODO %?\n  %i\n  %a"))
           )
#+END_SRC
**** Notes
My bindings for org-mode
|---------+------------------------------+-----------------------|
| binding | M-x                          | description           |
|---------+------------------------------+-----------------------|
| C-c a   | org-agenda                   | Agenda view           |
| C-c c   | org-capture-goto-last-stored | Capture via templates |
| C-c o   | org-revisit                  |                       |
|---------+------------------------------+-----------------------|
- TODO It would be neat if the above table could be used to generate
  the required emacs-lisp for the keybindings.

**** Faces
Even if I sometimes use =variable-pitch-mode= when reading org-files, I still want the tables and code blocks to use fixed pitch (monospaced fonts).

**** Monospace fonts for tables, quotes et c
#+BEGIN_SRC emacs-lisp
        (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
        (set-face-attribute 'org-code nil :inherit 'fixed-pitch)
        (set-face-attribute 'org-block nil :inherit 'fixed-pitch)
        (set-face-attribute 'org-verbatim nil :inherit 'fixed-pitch)
        (set-face-attribute 'org-block-begin-line nil :inherit 'fixed-pitch)
        (set-face-attribute 'org-block-end-line nil :inherit 'fixed-pitch)
        (set-face-attribute 'font-lock-builtin-face nil :inherit 'fixed-pitch)
#+END_SRC

**** Publishing from org-mode
