jmn.html
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> Writing</h4>
<div class="outline-text-4" id="text-1-7-1">
</div><div id="outline-container-sec-1-7-1-1" class="outline-5">
<h5 id="sec-1-7-1-1"><span class="section-number-5">1.7.1.1</span> ASCIIDoc mode (adoc-mode)</h5>
<div class="outline-text-5" id="text-1-7-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">adoc-mode</span>
<span style="color: #e090d7;">:ensure</span> adoc-mode
<span style="color: #e090d7;">:mode</span> <span style="color: #e9b96e;">"\\.asciidoc\\'"</span>
<span style="color: #e090d7;">:config</span>
(add-hook 'adoc-mode-hook (<span style="color: #b4fa70;">lambda</span>() (buffer-face-mode t))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-1-2" class="outline-5">
<h5 id="sec-1-7-1-2"><span class="section-number-5">1.7.1.2</span> Visual line mode in text (and org) files</h5>
<div class="outline-text-5" id="text-1-7-1-2">
<p>
<code>visual-line-mode</code> is so much better than <code>auto-fill-mode</code>. It doesn't actually break the text into multiple lines - it only looks that way.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(remove-hook 'text-mode-hook #'turn-on-auto-fill)
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-1-3" class="outline-5">
<h5 id="sec-1-7-1-3"><span class="section-number-5">1.7.1.3</span> Writeroom-mode</h5>
<div class="outline-text-5" id="text-1-7-1-3">
<p>
Writeroom-mode hides most UI elements.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">writeroom-mode</span>
  <span style="color: #e090d7;">:ensure</span> writeroom-mode
  )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> org-mode: note-taking, activity management et c.</h4>
<div class="outline-text-4" id="text-1-7-2">
</div><div id="outline-container-sec-1-7-2-1" class="outline-5">
<h5 id="sec-1-7-2-1"><span class="section-number-5">1.7.2.1</span> General org-mode buffer settings</h5>
<div class="outline-text-5" id="text-1-7-2-1">
<p>
Change the font-face so that only the last star indicating an org-mode headline is displayed. This is less resource intensive - and slightly different from -  org-indent-mode).
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-hide-leading-stars 't)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2-2" class="outline-5">
<h5 id="sec-1-7-2-2"><span class="section-number-5">1.7.2.2</span> Inline code (org-babel)</h5>
<div class="outline-text-5" id="text-1-7-2-2">
</div><ol class="org-ol"><li><a id="sec-1-7-2-2-1"></a>Load languages<br  /><div class="outline-text-6" id="text-1-7-2-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">Load relevant languages</span>
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (clojure . t)
   (<span style="color: #b4fa70;">go</span> . t)))
</pre>
</div>
</div>
</li>
<li><a id="sec-1-7-2-2-2"></a>Language mode specific settings<br  /><ol class="org-ol"><li><a id="sec-1-7-2-2-2-1"></a>Clojure<br  /><div class="outline-text-7" id="text-1-7-2-2-2-1">
<p>
Use cider as the clojure execution backend.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-babel-clojure-backend 'cider)
</pre>
</div>
</div>
</li></ol>
</li>
<li><a id="sec-1-7-2-2-3"></a>Indention and tabs, Tabs and indentation, in code blocks<br  /><div class="outline-text-6" id="text-1-7-2-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">Let's have pretty source code blocks</span>
<span style="color: #73d216;">;; </span><span style="color: #ff0000; font-weight: bold;">FIXME</span><span style="color: #73d216;">:  org-src-fontify-natively t -- Problem with variable pitch fonts.</span>
(setq org-src-fontify-natively nil)
(setq org-edit-src-content-indentation 4
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil)
</pre>
</div>
</div>
</li>
<li><a id="sec-1-7-2-2-4"></a>Code block expansion templates<br  /><div class="outline-text-6" id="text-1-7-2-2-4">
<p>
Type &lt;s [TAB] , &lt;el [TAB et c to create code blocks. (<a href="http://kitchingroup.cheme.cmu.edu/blog/2014/01/26/Language-specific-default-headers-for-code-blocks-in-org-mode/">source</a>)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #73d216;">add &lt;p for python expansion</span>
(add-to-list 'org-structure-template-alist
             '(<span style="color: #e9b96e;">"p"</span> <span style="color: #e9b96e;">"#+BEGIN_SRC python\n?\n#+END_SRC"</span> <span style="color: #e9b96e;">"&lt;src lang=\"python\"&gt;\n?\n&lt;/src&gt;"</span>))

<span style="color: #73d216;">;; </span><span style="color: #73d216;">add &lt;el for emacs-lisp expansion</span>
(add-to-list 'org-structure-template-alist
             '(<span style="color: #e9b96e;">"el"</span> <span style="color: #e9b96e;">"#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"</span> <span style="color: #e9b96e;">"&lt;src lang=\"emacs-lisp\"&gt;\n?\n&lt;/src&gt;"</span>))
</pre>
</div>
</div>
</li>

<li><a id="sec-1-7-2-2-5"></a>Evaluation<br  /><div class="outline-text-6" id="text-1-7-2-2-5">
<p>
To make code blocks evaluate silently by default:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-babel-default-header-args
          '((<span style="color: #e090d7;">:results</span> . <span style="color: #e9b96e;">"silent"</span>)
                ))
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-7-2-3" class="outline-5">
<h5 id="sec-1-7-2-3"><span class="section-number-5">1.7.2.3</span> org-capture templates</h5>
<div class="outline-text-5" id="text-1-7-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-capture-templates
   '(
     (<span style="color: #e9b96e;">"n"</span> <span style="color: #e9b96e;">"Short note"</span> entry (file+datetree <span style="color: #e9b96e;">"~/org/notes.org"</span>) 
      <span style="color: #e9b96e;">""</span> <span style="color: #e090d7;">:empty-lines</span> 1)
     (<span style="color: #e9b96e;">"b"</span> <span style="color: #e9b96e;">"Weblog post"</span> entry (file+datetree <span style="color: #e9b96e;">"~/org/notes.org"</span>) 
      <span style="color: #e9b96e;">"* %^{Title}\n :PROPERTIES:\n:on: %T\n:END:\n  %? %i"</span> <span style="color: #e090d7;">:empty-lines</span> 1)
     (<span style="color: #e9b96e;">"t"</span> <span style="color: #e9b96e;">"Todo"</span> entry (file+headline <span style="color: #e9b96e;">"~/org/gtd.org"</span> <span style="color: #e9b96e;">"Tasks"</span>)
          <span style="color: #e9b96e;">"* TODO %?\n  %i\n  %a"</span>))
   )
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2-4" class="outline-5">
<h5 id="sec-1-7-2-4"><span class="section-number-5">1.7.2.4</span> Notes</h5>
<div class="outline-text-5" id="text-1-7-2-4">
<p>
My bindings for org-mode
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">binding</th>
<th scope="col" class="left">M-x</th>
<th scope="col" class="left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">C-c a</td>
<td class="left">org-agenda</td>
<td class="left">Agenda view</td>
</tr>

<tr>
<td class="left">C-c c</td>
<td class="left">org-capture-goto-last-stored</td>
<td class="left">Capture via templates</td>
</tr>

<tr>
<td class="left">C-c o</td>
<td class="left">org-revisit</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>TODO It would be neat if the above table could be used to generate
the required emacs-lisp for the keybindings.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-7-2-5" class="outline-5">
<h5 id="sec-1-7-2-5"><span class="section-number-5">1.7.2.5</span> Faces</h5>
<div class="outline-text-5" id="text-1-7-2-5">
<p>
Even if I sometimes use <code>variable-pitch-mode</code> when reading org-files, I still want the tables and code blocks to use fixed pitch (monospaced fonts).
</p>
</div>
</div>

<div id="outline-container-sec-1-7-2-6" class="outline-5">
<h5 id="sec-1-7-2-6"><span class="section-number-5">1.7.2.6</span> Monospace fonts for tables, quotes et c</h5>
<div class="outline-text-5" id="text-1-7-2-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'org-table nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-code nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-block nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-verbatim nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-block-begin-line nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'org-block-end-line nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
(set-face-attribute 'font-lock-builtin-face nil <span style="color: #e090d7;">:inherit</span> 'fixed-pitch)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-2-7" class="outline-5">
<h5 id="sec-1-7-2-7"><span class="section-number-5">1.7.2.7</span> Publishing from org-mode</h5>
