org/jmn.org
***** Publish projects
#+BEGIN_SRC emacs-lisp
        (setq org-publish-project-alist
              (list
               `("emacs-notes"
                   :base-directory "~/git/notes/"
                   :base-extension "org"
                   :publishing-directory "~/git/jmn.github.io"
                   :recursive nil
                   :publishing-function org-html-publish-to-html
                   :include ("jmn.org" "emacs.org")
                   :exclude "\\.org$"
                   )
               `("emacs-notes-org"
                   :base-directory "~/git/notes/"
                   :base-extension "org"
                   :publishing-directory "~/git/jmn.github.io/org"
                   :recursive nil
                   :publishing-function org-org-publish-to-org
                   :include ("jmn.org" "emacs.org")
                   :exclude "\\.org$"
                   ))
              )
#+END_SRC
***** Org-jekyll
Export configuration for Juan Reyeros org-jekyll to export org subtrees to Jekyll.
The subtrees must have the tag "blog" and a property "on" with a timestamp.
****** Helper function "blogthis" to export org subtrees to jekyll via org-jekyll.
#+BEGIN_SRC emacs-lisp
        (require 'ox)
            (defun blogthis ()
              "add the necessary tags and properties to publish an org subtree"
              (interactive)
              (org-back-to-heading t)
              (org-set-tags-to "blog")
              (org-set-property "on" (format-time-string "%Y-%m-%d %H:%M" (current-time)))
              (org-jekyll-export-current-entry)
              )
#+END_SRC

****** Org-jekyll configuration
#+BEGIN_SRC emacs-lisp
        (use-package org-jekyll
        :ensure org-jekyll
        :config 

            (add-to-list 'org-publish-project-alist
                   '("jmn-org"
                     :base-directory "~/org"
                     :recursive t
                     :base-extension "org"
                     :publishing-directory "~/git/jmn.github.io/"
                     :exclude "^blog\\|^bitacora\\|jr.org"
                     :site-root "http://www.jmnorlund.net"
                     :jekyll-sanitize-permalinks t
                     :publishing-function org-html-publish-to-html
                     :section-numbers nil
                     :headline-levels 4
                     :table-of-contents t
                     :auto-index nil
                     :auto-preamble nil
                     :body-only nil
                     :auto-postamble nil))

            (add-to-list 'org-publish-project-alist
                         '("jmn" :components ("jmn-org")))
        )
#+END_SRC

****** Run jekyll after org-capture
#+BEGIN_SRC emacs-lisp :tangle no
                                                ; FIXME: This currently does not work as ork-jekyll-export-current-entry
                                                ; uses the filename to get the org project and the capture buffer has no 
                                                ; file name.
        (add-hook 'org-capture-after-finalize-hook 'org-jekyll-export-current-entry)
#+END_SRC
***** Jekyll
Function to insert a YAML front matter (at cursor point).

#+BEGIN_SRC emacs-lisp
        (defun insert-YAML-front-matter (string)
          "Insert \label{ARG} \index{\nameref{ARG}} at point"
          (interactive "sString for \\title: ")
          (insert "#+BEGIN_HTML
        ---
        layout: post
        title: " string " 
        tags: 
        ---
        ,#+END_HTML"))
#+END_SRC
***** Blogging, with org2blog
I have a wordpress.com blog and use =org2blog= to publish posts.
Authentication info is in =~/.authinfo= and follows the following form:
=machine myblog login myusername password myrealpassword=

See the[[https://github.com/punchagan/org2blog][ org2blog webpage]] for more information.

To blog I usually just use =M-x org2blog/wp-post-subtree= from an org-mode subtree.

#+BEGIN_SRC emacs-lisp :tangle no
        (unless (package-installed-p 'org2blog)  
          (package-install 'org2blog))     

        (require 'org2blog-autoloads)
        (setq org2blog/wp-blog-alist
              '(("wordpress"
                 :url "http://notatum.wordpress.com/xmlrpc.php"
                 :username "jmnoz"
                 :default-title "Hello World"
                 :default-categories ("org2blog" "emacs")
                 :tags-as-categories nil)
                        ))

        (require 'auth-source) ;; or nothing if already in the load-path

        (let (credentials)
          ;; only required if your auth file is not already in the list of auth-sources
          (add-to-list 'auth-sources "~/.authinfo")
          (setq credentials (auth-source-user-and-password "wordpress"))
          (setq org2blog/wp-blog-alist
                `(("wordpress"
                   :url "http://notatum.wordpress.com/xmlrpc.php"
                   :username ,(car credentials)
                   :password ,(cadr credentials)))))
#+END_SRC
*** Programming
