jmn.html
<div class="outline-text-5" id="text-1-7-2-7">
</div><ol class="org-ol"><li><a id="sec-1-7-2-7-1"></a>Publish projects<br  /><div class="outline-text-6" id="text-1-7-2-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-publish-project-alist
      (list
       `(<span style="color: #e9b96e;">"emacs-notes"</span>
           <span style="color: #e090d7;">:base-directory</span> <span style="color: #e9b96e;">"~/git/notes/"</span>
           <span style="color: #e090d7;">:base-extension</span> <span style="color: #e9b96e;">"org"</span>
           <span style="color: #e090d7;">:publishing-directory</span> <span style="color: #e9b96e;">"~/git/jmn.github.io"</span>
           <span style="color: #e090d7;">:recursive</span> nil
           <span style="color: #e090d7;">:publishing-function</span> org-html-publish-to-html
           <span style="color: #e090d7;">:include</span> (<span style="color: #e9b96e;">"jmn.org"</span> <span style="color: #e9b96e;">"emacs.org"</span>)
           <span style="color: #e090d7;">:exclude</span> <span style="color: #e9b96e;">"\\.org$"</span>
           )
       `(<span style="color: #e9b96e;">"emacs-notes-org"</span>
           <span style="color: #e090d7;">:base-directory</span> <span style="color: #e9b96e;">"~/git/notes/"</span>
           <span style="color: #e090d7;">:base-extension</span> <span style="color: #e9b96e;">"org"</span>
           <span style="color: #e090d7;">:publishing-directory</span> <span style="color: #e9b96e;">"~/git/jmn.github.io/org"</span>
           <span style="color: #e090d7;">:recursive</span> nil
           <span style="color: #e090d7;">:publishing-function</span> org-org-publish-to-org
           <span style="color: #e090d7;">:include</span> (<span style="color: #e9b96e;">"jmn.org"</span> <span style="color: #e9b96e;">"emacs.org"</span>)
           <span style="color: #e090d7;">:exclude</span> <span style="color: #e9b96e;">"\\.org$"</span>
           ))
      )
</pre>
</div>
</div>
</li>
<li><a id="sec-1-7-2-7-2"></a>Org-jekyll<br  /><div class="outline-text-6" id="text-1-7-2-7-2">
<p>
Export configuration for Juan Reyeros org-jekyll to export org subtrees to Jekyll.
The subtrees must have the tag "blog" and a property "on" with a timestamp.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-7-2-7-2-1"></a>Helper function "blogthis" to export org subtrees to jekyll via org-jekyll.<br  /><div class="outline-text-7" id="text-1-7-2-7-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">ox</span>)
    (<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">blogthis</span> ()
      <span style="color: #e9b96e;">"add the necessary tags and properties to publish an org subtree"</span>
      (interactive)
      (org-back-to-heading t)
      (org-set-tags-to <span style="color: #e9b96e;">"blog"</span>)
      (org-set-property <span style="color: #e9b96e;">"on"</span> (format-time-string <span style="color: #e9b96e;">"%Y-%m-%d %H:%M"</span> (current-time)))
      (org-jekyll-export-current-entry)
      )
</pre>
</div>
</div>
</li>

<li><a id="sec-1-7-2-7-2-2"></a>Org-jekyll configuration<br  /><div class="outline-text-7" id="text-1-7-2-7-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">org-jekyll</span>
<span style="color: #e090d7;">:ensure</span> org-jekyll
<span style="color: #e090d7;">:config</span> 

    (add-to-list 'org-publish-project-alist
           '(<span style="color: #e9b96e;">"jmn-org"</span>
             <span style="color: #e090d7;">:base-directory</span> <span style="color: #e9b96e;">"~/org"</span>
             <span style="color: #e090d7;">:recursive</span> t
             <span style="color: #e090d7;">:base-extension</span> <span style="color: #e9b96e;">"org"</span>
             <span style="color: #e090d7;">:publishing-directory</span> <span style="color: #e9b96e;">"~/git/jmn.github.io/"</span>
             <span style="color: #e090d7;">:exclude</span> <span style="color: #e9b96e;">"^blog</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">|</span><span style="color: #e9b96e;">^bitacora</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">|</span><span style="color: #e9b96e;">jr.org"</span>
             <span style="color: #e090d7;">:site-root</span> <span style="color: #e9b96e;">"http://www.jmnorlund.net"</span>
             <span style="color: #e090d7;">:jekyll-sanitize-permalinks</span> t
             <span style="color: #e090d7;">:publishing-function</span> org-html-publish-to-html
             <span style="color: #e090d7;">:section-numbers</span> nil
             <span style="color: #e090d7;">:headline-levels</span> 4
             <span style="color: #e090d7;">:table-of-contents</span> t
             <span style="color: #e090d7;">:auto-index</span> nil
             <span style="color: #e090d7;">:auto-preamble</span> nil
             <span style="color: #e090d7;">:body-only</span> nil
             <span style="color: #e090d7;">:auto-postamble</span> nil))

    (add-to-list 'org-publish-project-alist
                 '(<span style="color: #e9b96e;">"jmn"</span> <span style="color: #e090d7;">:components</span> (<span style="color: #e9b96e;">"jmn-org"</span>)))
)
</pre>
</div>
</div>
</li>

<li><a id="sec-1-7-2-7-2-3"></a>Run jekyll after org-capture<br  /><div class="outline-text-7" id="text-1-7-2-7-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">                                        <span style="color: #73d216;">; </span><span style="color: #ff0000; font-weight: bold;">FIXME</span><span style="color: #73d216;">: This currently does not work as ork-jekyll-export-current-entry</span>
                                        <span style="color: #73d216;">; </span><span style="color: #73d216;">uses the filename to get the org project and the capture buffer has no </span>
                                        <span style="color: #73d216;">; </span><span style="color: #73d216;">file name.</span>
(add-hook 'org-capture-after-finalize-hook 'org-jekyll-export-current-entry)
</pre>
</div>
</div>
</li></ol>
</li>
<li><a id="sec-1-7-2-7-3"></a>Jekyll<br  /><div class="outline-text-6" id="text-1-7-2-7-3">
<p>
Function to insert a YAML front matter (at cursor point).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">insert-YAML-front-matter</span> (string)
  <span style="color: #e9b96e;">"Insert \label{ARG} \index{\nameref{ARG}} at point"</span>
  (interactive <span style="color: #e9b96e;">"sString for \\title: "</span>)
  (insert <span style="color: #e9b96e;">"#+BEGIN_HTML</span>
<span style="color: #e9b96e;">---</span>
<span style="color: #e9b96e;">layout: post</span>
<span style="color: #e9b96e;">title: "</span> string <span style="color: #e9b96e;">" </span>
<span style="color: #e9b96e;">tags: </span>
<span style="color: #e9b96e;">---</span>
<span style="color: #e9b96e;">#+END_HTML"</span>))
</pre>
</div>
</div>
</li>
<li><a id="sec-1-7-2-7-4"></a>Blogging, with org2blog<br  /><div class="outline-text-6" id="text-1-7-2-7-4">
<p>
I have a wordpress.com blog and use <code>org2blog</code> to publish posts.
Authentication info is in <code>~/.authinfo</code> and follows the following form:
<code>machine myblog login myusername password myrealpassword</code>
</p>

<p>
See the<a href="https://github.com/punchagan/org2blog"> org2blog webpage</a> for more information.
</p>

<p>
To blog I usually just use <code>M-x org2blog/wp-post-subtree</code> from an org-mode subtree.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">unless</span> (package-installed-p 'org2blog)  
  (package-install 'org2blog))     

(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">org2blog-autoloads</span>)
(setq org2blog/wp-blog-alist
      '((<span style="color: #e9b96e;">"wordpress"</span>
         <span style="color: #e090d7;">:url</span> <span style="color: #e9b96e;">"http://notatum.wordpress.com/xmlrpc.php"</span>
         <span style="color: #e090d7;">:username</span> <span style="color: #e9b96e;">"jmnoz"</span>
         <span style="color: #e090d7;">:default-title</span> <span style="color: #e9b96e;">"Hello World"</span>
         <span style="color: #e090d7;">:default-categories</span> (<span style="color: #e9b96e;">"org2blog"</span> <span style="color: #e9b96e;">"emacs"</span>)
         <span style="color: #e090d7;">:tags-as-categories</span> nil)
                ))

(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">auth-source</span>) <span style="color: #73d216;">;; </span><span style="color: #73d216;">or nothing if already in the load-path</span>

(<span style="color: #b4fa70;">let</span> (credentials)
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">only required if your auth file is not already in the list of auth-sources</span>
  (add-to-list 'auth-sources <span style="color: #e9b96e;">"~/.authinfo"</span>)
  (setq credentials (auth-source-user-and-password <span style="color: #e9b96e;">"wordpress"</span>))
  (setq org2blog/wp-blog-alist
        `((<span style="color: #e9b96e;">"wordpress"</span>
           <span style="color: #e090d7;">:url</span> <span style="color: #e9b96e;">"http://notatum.wordpress.com/xmlrpc.php"</span>
           <span style="color: #e090d7;">:username</span> ,(car credentials)
           <span style="color: #e090d7;">:password</span> ,(cadr credentials)))))
</pre>
</div>
</div>
</li></ol>
</div>
</div>
