org/jmn.org
**** Highlight keywords
#+BEGIN_SRC emacs-lisp
        ;; FIXME: This highlights FIXME:'s 
        (add-hook 'prog-mode-hook
                  (lambda ()
                    (font-lock-add-keywords nil
                                            '(("\\<\\(FIXME\\|TODO\\|BUG\\):" 1 font-lock-warning-face t)))))
#+END_SRC
**** Go autocomplete
Using [[https://github.com/nsf/gocode]]

#+BEGIN_SRC emacs-lisp
        (use-package auto-complete
        :ensure auto-complete)
        (use-package go-mode
        :ensure go-mode)
        (use-package go-autocomplete
        :ensure go-autocomplete)
        (require 'auto-complete-config)
        (add-hook 'go-mode-hook 'auto-complete-mode)
#+END_SRC

**** Clojure
Enable paredit-mode in clojure-mode and the cider REPL.

#+BEGIN_SRC emacs-lisp
        (use-package cider 
        :ensure t)
        (defun lisp-enable-paredit-hook () (paredit-mode 1))
        (add-hook 'clojure-mode-hook 'lisp-enable-paredit-hook)
        (add-hook 'cider-repl-mode-hook 'paredit-mode)
#+END_SRC

***** Cider configuration
#+BEGIN_SRC emacs-lisp
        (require 'cider)
        (setq nrepl-hide-special-buffers t
              cider-repl-pop-to-buffer-on-connect nil
              cider-popup-stacktraces nil
              cider-repl-popup-stacktraces t)
#+END_SRC

**** Magit - nice git interface
***** Notes, set up
To perform push/pull to remote repositories over SSH you need to configure your local key management.
****** How to configure ssh keys on MS Windows
See here:
[[https://github.com/magit/magit/wiki/FAQ#windows-cannot-push-with-ssh-passphrase]]

[[https://help.github.com/articles/working-with-ssh-key-passphrases/#auto-launching-ssh-agent-on-msysgit]]

You will need to launch git bash to get ssh-agent running before starting Emacs, then =(load-file "~/.ssh/agent.env.el")=.
#+BEGIN_SRC emacs-lisp
        (if (eq system-type 'windows-nt)  ; Windows settings
            (load-file "~/.ssh/agent.env.el")
          )
#+END_SRC
1. Install [[http://msysgit.github.io/][Git for Windows]] (msysgit)
Authentication is usually the tricky part (it can cause the git process to appear to hang on pull/push)

For HTTPS authentication see:
- [[https://gitcredentialstore.codeplex.com/]]
****** How to configure SSH keys on Mac
*** Editing
By default the C-x C-u binding for upcase-region is disabled.
#+BEGIN_SRC emacs-lisp
        (put 'upcase-region 'disabled nil)
#+END_SRC

**** Digits increment/decrement
This function can be used with =C-u= to decrement or increment by a given number.
Source: [[http://www.emacswiki.org/emacs/IncrementNumber][Emacswiki IncrementNumber]]

#+BEGIN_SRC emacs-lisp
        (defun my-increment-number-decimal (&optional arg)
          "Increment the number forward from point by 'arg'."
          (interactive "p*")
          (save-excursion
            (save-match-data
              (let (inc-by field-width answer)
                (setq inc-by (if arg arg 1))
                (skip-chars-backward "0123456789")
                (when (re-search-forward "[0-9]+" nil t)
                  (setq field-width (- (match-end 0) (match-beginning 0)))
                  (setq answer (+ (string-to-number (match-string 0) 10) inc-by))
                  (when (< answer 0)
                    (setq answer (+ (expt 10 field-width) answer)))
                  (replace-match (format (concat "%0" (int-to-string field-width) "d")
                                         answer)))))))

        (global-set-key (kbd "C-c i") 'my-increment-number-decimal)
#+END_SRC

*** Diffing (ediff)
**** Ediff for org-files
Running ediff on org files might cause trouble with hidden lines. This
code attempts to remedy that.  ([[http://lists.gnu.org/archive/html/emacs-orgmode/2013-04/msg00400.html][source]])

#+BEGIN_SRC emacs-lisp
        (add-hook 'ediff-prepare-buffer-hook 'f-ediff-prepare-buffer-hook-setup)
        (defun f-ediff-prepare-buffer-hook-setup ()
          ;; specific modes
          (cond ((eq major-mode 'org-mode)
                 (f-org-vis-mod-maximum))
                ;; room for more modes
                )
          ;; all modes
          (setq truncate-lines nil))
        (defun f-org-vis-mod-maximum ()
          "Visibility: Show the most possible."
          (cond
           ((eq major-mode 'org-mode)
            (visible-mode 1)  ; default 0
            (setq truncate-lines nil)  ; no `org-startup-truncated' in hook
            (setq org-hide-leading-stars t))  ; default nil
           (t
            (message "ERR: not in Org mode")
            (ding))))
#+END_SRC
*** IRC
Use =M-x erc-tls= to connect

Hide Join/part/quit messages from IRC "lurkers" (people who aren't active).
#+BEGIN_SRC emacs-lisp
        (setq erc-lurker-hide-list '("JOIN" "PART" "QUIT"))
#+END_SRC
