jmn.html
<div id="outline-container-sec-1-7-3" class="outline-4">
<h4 id="sec-1-7-3"><span class="section-number-4">1.7.3</span> Programming</h4>
<div class="outline-text-4" id="text-1-7-3">
</div><div id="outline-container-sec-1-7-3-1" class="outline-5">
<h5 id="sec-1-7-3-1"><span class="section-number-5">1.7.3.1</span> Highlight keywords</h5>
<div class="outline-text-5" id="text-1-7-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #73d216;">;; </span><span style="color: #ff0000; font-weight: bold;">FIXME</span><span style="color: #73d216;">: This highlights </span><span style="color: #ff0000; font-weight: bold;">FIXME</span><span style="color: #73d216;">:'s </span>
(add-hook 'prog-mode-hook
          (<span style="color: #b4fa70;">lambda</span> ()
            (font-lock-add-keywords nil
                                    '((<span style="color: #e9b96e;">"\\&lt;</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">(</span><span style="color: #e9b96e;">FIXME</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">|</span><span style="color: #e9b96e;">TODO</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">|</span><span style="color: #e9b96e;">BUG</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">)</span><span style="color: #e9b96e;">:"</span> 1 font-lock-warning-face t)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-3-2" class="outline-5">
<h5 id="sec-1-7-3-2"><span class="section-number-5">1.7.3.2</span> Go autocomplete</h5>
<div class="outline-text-5" id="text-1-7-3-2">
<p>
Using <a href="https://github.com/nsf/gocode">https://github.com/nsf/gocode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">auto-complete</span>
<span style="color: #e090d7;">:ensure</span> auto-complete)
(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">go-mode</span>
<span style="color: #e090d7;">:ensure</span> go-mode)
(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">go-autocomplete</span>
<span style="color: #e090d7;">:ensure</span> go-autocomplete)
(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">auto-complete-config</span>)
(add-hook 'go-mode-hook 'auto-complete-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-3-3" class="outline-5">
<h5 id="sec-1-7-3-3"><span class="section-number-5">1.7.3.3</span> Clojure</h5>
<div class="outline-text-5" id="text-1-7-3-3">
<p>
Enable paredit-mode in clojure-mode and the cider REPL.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">use-package</span> <span style="color: #e9b2e3;">cider</span> 
<span style="color: #e090d7;">:ensure</span> t)
(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">lisp-enable-paredit-hook</span> () (paredit-mode 1))
(add-hook 'clojure-mode-hook 'lisp-enable-paredit-hook)
(add-hook 'cider-repl-mode-hook 'paredit-mode)
</pre>
</div>
</div>

<ol class="org-ol"><li><a id="sec-1-7-3-3-1"></a>Cider configuration<br  /><div class="outline-text-6" id="text-1-7-3-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">require</span> '<span style="color: #e9b2e3;">cider</span>)
(setq nrepl-hide-special-buffers t
      cider-repl-pop-to-buffer-on-connect nil
      cider-popup-stacktraces nil
      cider-repl-popup-stacktraces t)
</pre>
</div>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-7-3-4" class="outline-5">
<h5 id="sec-1-7-3-4"><span class="section-number-5">1.7.3.4</span> Magit - nice git interface</h5>
<div class="outline-text-5" id="text-1-7-3-4">
</div><ol class="org-ol"><li><a id="sec-1-7-3-4-1"></a>Notes, set up<br  /><div class="outline-text-6" id="text-1-7-3-4-1">
<p>
To perform push/pull to remote repositories over SSH you need to configure your local key management.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-7-3-4-1-1"></a>How to configure ssh keys on MS Windows<br  /><div class="outline-text-7" id="text-1-7-3-4-1-1">
<p>
See here:
<a href="https://github.com/magit/magit/wiki/FAQ#windows-cannot-push-with-ssh-passphrase">https://github.com/magit/magit/wiki/FAQ#windows-cannot-push-with-ssh-passphrase</a>
</p>

<p>
<a href="https://help.github.com/articles/working-with-ssh-key-passphrases/#auto-launching-ssh-agent-on-msysgit">https://help.github.com/articles/working-with-ssh-key-passphrases/#auto-launching-ssh-agent-on-msysgit</a>
</p>

<p>
You will need to launch git bash to get ssh-agent running before starting Emacs, then <code>(load-file "~/.ssh/agent.env.el")</code>.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">if</span> (eq system-type 'windows-nt)  <span style="color: #73d216;">; </span><span style="color: #73d216;">Windows settings</span>
    (load-file <span style="color: #e9b96e;">"~/.ssh/agent.env.el"</span>)
  )
</pre>
</div>
<ol class="org-ol">
<li>Install <a href="http://msysgit.github.io/">Git for Windows</a> (msysgit)
</li>
</ol>
<p>
Authentication is usually the tricky part (it can cause the git process to appear to hang on pull/push)
</p>

<p>
For HTTPS authentication see:
</p>
<ul class="org-ul">
<li><a href="https://gitcredentialstore.codeplex.com/">https://gitcredentialstore.codeplex.com/</a>
</li>
</ul>
</div>
</li>
<li><a id="sec-1-7-3-4-1-2"></a>How to configure SSH keys on Mac<br  /></li></ol>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-7-4" class="outline-4">
<h4 id="sec-1-7-4"><span class="section-number-4">1.7.4</span> Editing</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
By default the C-x C-u binding for upcase-region is disabled.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(put 'upcase-region 'disabled nil)
</pre>
</div>
</div>

<div id="outline-container-sec-1-7-4-1" class="outline-5">
<h5 id="sec-1-7-4-1"><span class="section-number-5">1.7.4.1</span> Digits increment/decrement</h5>
<div class="outline-text-5" id="text-1-7-4-1">
<p>
This function can be used with <code>C-u</code> to decrement or increment by a given number.
Source: <a href="http://www.emacswiki.org/emacs/IncrementNumber">Emacswiki IncrementNumber</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-increment-number-decimal</span> (<span style="color: #8cc4ff;">&amp;optional</span> arg)
  <span style="color: #e9b96e;">"Increment the number forward from point by 'arg'."</span>
  (interactive <span style="color: #e9b96e;">"p*"</span>)
  (<span style="color: #b4fa70;">save-excursion</span>
    (<span style="color: #b4fa70;">save-match-data</span>
      (<span style="color: #b4fa70;">let</span> (inc-by field-width answer)
        (setq inc-by (<span style="color: #b4fa70;">if</span> arg arg 1))
        (skip-chars-backward <span style="color: #e9b96e;">"0123456789"</span>)
        (<span style="color: #b4fa70;">when</span> (re-search-forward <span style="color: #e9b96e;">"[0-9]+"</span> nil t)
          (setq field-width (- (match-end 0) (match-beginning 0)))
          (setq answer (+ (string-to-number (match-string 0) 10) inc-by))
          (<span style="color: #b4fa70;">when</span> (&lt; answer 0)
            (setq answer (+ (expt 10 field-width) answer)))
          (replace-match (format (concat <span style="color: #e9b96e;">"%0"</span> (int-to-string field-width) <span style="color: #e9b96e;">"d"</span>)
                                 answer)))))))

(global-set-key (kbd <span style="color: #e9b96e;">"C-c i"</span>) 'my-increment-number-decimal)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-7-5" class="outline-4">
<h4 id="sec-1-7-5"><span class="section-number-4">1.7.5</span> Diffing (ediff)</h4>
<div class="outline-text-4" id="text-1-7-5">
</div><div id="outline-container-sec-1-7-5-1" class="outline-5">
<h5 id="sec-1-7-5-1"><span class="section-number-5">1.7.5.1</span> Ediff for org-files</h5>
<div class="outline-text-5" id="text-1-7-5-1">
<p>
Running ediff on org files might cause trouble with hidden lines. This
code attempts to remedy that.  (<a href="http://lists.gnu.org/archive/html/emacs-orgmode/2013-04/msg00400.html">source</a>)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'ediff-prepare-buffer-hook 'f-ediff-prepare-buffer-hook-setup)
(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">f-ediff-prepare-buffer-hook-setup</span> ()
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">specific modes</span>
  (<span style="color: #b4fa70;">cond</span> ((eq major-mode 'org-mode)
         (f-org-vis-mod-maximum))
        <span style="color: #73d216;">;; </span><span style="color: #73d216;">room for more modes</span>
        )
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">all modes</span>
  (setq truncate-lines nil))
(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">f-org-vis-mod-maximum</span> ()
  <span style="color: #e9b96e;">"Visibility: Show the most possible."</span>
  (<span style="color: #b4fa70;">cond</span>
   ((eq major-mode 'org-mode)
    (visible-mode 1)  <span style="color: #73d216;">; </span><span style="color: #73d216;">default 0</span>
    (setq truncate-lines nil)  <span style="color: #73d216;">; </span><span style="color: #73d216;">no `</span><span style="color: #e9b2e3;">org-startup-truncated</span><span style="color: #73d216;">' in hook</span>
    (setq org-hide-leading-stars t))  <span style="color: #73d216;">; </span><span style="color: #73d216;">default nil</span>
   (t
    (message <span style="color: #e9b96e;">"ERR: not in Org mode"</span>)
    (ding))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-6" class="outline-4">
<h4 id="sec-1-7-6"><span class="section-number-4">1.7.6</span> IRC</h4>
<div class="outline-text-4" id="text-1-7-6">
<p>
Use <code>M-x erc-tls</code> to connect
</p>

<p>
Hide Join/part/quit messages from IRC "lurkers" (people who aren't active).
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq erc-lurker-hide-list '(<span style="color: #e9b96e;">"JOIN"</span> <span style="color: #e9b96e;">"PART"</span> <span style="color: #e9b96e;">"QUIT"</span>))
</pre>
</div>
</div>
</div>
